garyPenhook/PyAvrOCD/svd/avr16eb32.svd
        <register>
          <name>FAULTCTRL</name>
          <description>Fault Control</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FDACT</name>
              <description>Fault Detection Action</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None. Fault Protection Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Drive all pins low</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUSTOM</name>
                  <description>Drive all pins to setting defined by FAULTDRV and FAULTVAL</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDMODE</name>
              <description>Fault Detection Restart Mode</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LATCHED</name>
                  <description>Latched Mode. Output will remain in fault state until fault condition is no longer active and FDF is cleared by SW.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC</name>
                  <description>Cycle-by-cycle mode. Waveform output will remain in fault state until fault condition is no longer active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDDBD</name>
              <description>Fault Detection on Debug Break Detection</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAULT</name>
                  <description>OCD Break request is treated as a fault if fault protection is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IGNORE</name>
                  <description>OCD Breask request will not trigger a fault</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULTDRV</name>
          <description>Fault Drive</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FAULTDRV0</name>
              <description>Fault Drive Enable Bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTDRV1</name>
              <description>Fault Drive Enable Bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTDRV2</name>
              <description>Fault Drive Enable Bit 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTDRV3</name>
              <description>Fault Drive Enable Bit 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTDRV4</name>
              <description>Fault Drive Enable Bit 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTDRV5</name>
              <description>Fault Drive Enable Bit 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTDRV6</name>
              <description>Fault Drive Enable Bit 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTDRV7</name>
              <description>Fault Drive Enable Bit 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULTOUT</name>
          <description>Fault Output</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FAULTOUT0</name>
              <description>Fault Output Value Bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTOUT1</name>
              <description>Fault Output Value Bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTOUT2</name>
              <description>Fault Output Value Bit 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTOUT3</name>
              <description>Fault Output Value Bit 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTOUT4</name>
              <description>Fault Output Value Bit 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTOUT5</name>
              <description>Fault Output Value Bit 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTOUT6</name>
              <description>Fault Output Value Bit 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTOUT7</name>
              <description>Fault Output Value Bit 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRL</name>
          <description>Interrupt Control</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FAULTDET</name>
              <description>Fault Detection Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FAULTDET</name>
              <description>Fault Detection Interrupt Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FDFEVA</name>
              <description>Fault Detection Flag Event Input A</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FDFEVB</name>
              <description>Fault Detection Flag Event Input B</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FDFEVC</name>
              <description>Fault Detection Flag Event Input C</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTOVEN</name>
          <description>Output Override Enable</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OUTOVEN0</name>
              <description>Output Override Enable Bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTOVEN1</name>
              <description>Output Override Enable Bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTOVEN2</name>
              <description>Output Override Enable Bit 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTOVEN3</name>
              <description>Output Override Enable Bit 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTOVEN4</name>
              <description>Output Override Enable Bit 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTOVEN5</name>
              <description>Output Override Enable Bit 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTOVEN6</name>
              <description>Output Override Enable Bit 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTOVEN7</name>
              <description>Output Override Enable Bit 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PGMOUT</name>
          <description>Pattern Generation Output</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PGMOUT0</name>
              <description>Pattern Generation Output Value Bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUT1</name>
              <description>Pattern Generation Output Value Bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUT2</name>
              <description>Pattern Generation Output Value Bit 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUT3</name>
              <description>Pattern Generation Output Value Bit 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUT4</name>
              <description>Pattern Generation Output Value Bit 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUT5</name>
              <description>Pattern Generation Output Value Bit 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUT6</name>
              <description>Pattern Generation Output Value Bit 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUT7</name>
              <description>Pattern Generation Output Value Bit 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PGMOUTBUF</name>
          <description>Pattern Generation Output Buffer</description>
          <addressOffset>0x1D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PGMOUTBUF0</name>
              <description>Pattern Generation Output Value Buffer Bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUTBUF1</name>
              <description>Pattern Generation Output Value Buffer Bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUTBUF2</name>
              <description>Pattern Generation Output Value Buffer Bit 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUTBUF3</name>
              <description>Pattern Generation Output Value Buffer Bit 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUTBUF4</name>
              <description>Pattern Generation Output Value Buffer Bit 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUTBUF5</name>
              <description>Pattern Generation Output Value Buffer Bit 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUTBUF6</name>
              <description>Pattern Generation Output Value Buffer Bit 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUTBUF7</name>
              <description>Pattern Generation Output Value Buffer Bit 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PGMOVR</name>
          <description>Pattern Generation Override</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PGMOVR0</name>
              <description>Pattern Generation Override Enable Bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVR1</name>
              <description>Pattern Generation Override Enable Bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVR2</name>
              <description>Pattern Generation Override Enable Bit 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVR3</name>
              <description>Pattern Generation Override Enable Bit 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVR4</name>
              <description>Pattern Generation Override Enable Bit 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVR5</name>
              <description>Pattern Generation Override Enable Bit 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVR6</name>
              <description>Pattern Generation Override Enable Bit 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVR7</name>
              <description>Pattern Generation Override Enable Bit 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PGMOVRBUF</name>
          <description>Pattern Generation Override Buffer</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PGMOVRBUF0</name>
              <description>Pattern Generation Override Enable Buffer Bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVRBUF1</name>
              <description>Pattern Generation Override Enable Buffer Bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVRBUF2</name>
              <description>Pattern Generation Override Enable Buffer Bit 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVRBUF3</name>
              <description>Pattern Generation Override Enable Buffer Bit 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVRBUF4</name>
              <description>Pattern Generation Override Enable Buffer Bit 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVRBUF5</name>
              <description>Pattern Generation Override Enable Buffer Bit 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVRBUF6</name>
              <description>Pattern Generation Override Enable Buffer Bit 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVRBUF7</name>
              <description>Pattern Generation Override Enable Buffer Bit 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FDSTATE</name>
              <description>Fault Detection State</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT</name>
                  <description>Fault state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDSEVA</name>
              <description>Fault Detection State Event A</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FDSEVB</name>
              <description>Fault Detection State Event B</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FDSEVC</name>
              <description>Fault Detection State Event C</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BLANKSTATE</name>
              <description>Blanking State</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Blanking off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Blanking active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWAP</name>
          <description>DTI Swap</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SWAP0</name>
              <description>Swap DTI Output Pair 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAP1</name>
              <description>Swap DTI Output Pair 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAP2</name>
              <description>Swap DTI Output Pair 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAP3</name>
              <description>Swap DTI Output Pair 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWAPBUF</name>
          <description>DTI Swap Buffer</description>
          <addressOffset>0x1B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SWAPBUF0</name>
              <description>Swap DTI Output Pair 0 Buffer</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAPBUF1</name>
              <description>Swap DTI Output Pair 1 Buffer</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAPBUF2</name>
              <description>Swap DTI Output Pair 2 Buffer</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAPBUF3</name>
              <description>Swap DTI Output Pair 3 Buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>